2021-02-10-dashboard.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/faq/rss.xml"
      title="RSS feed for https://martiyo.github.io/faq/"
    />
    <title>Dashboard, una pantalla de inicio extencible para emacs</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/faq">/home</a></li>
          <li><a href="https://martiyo.github.io/faq/about">/about</a></li>
          <li><a href="https://martiyo.github.io/faq/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Search..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">10 feb 2021</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/faq/2021-02-10-dashboard.html"
          >Dashboard, una pantalla de inicio extencible para emacs</a
        >
      </h1>
      <p>Pantalla de inicio practica y útil en <b>exwm</b>.</p>

      <div id="outline-container-org76ec7eb" class="outline-2">
        <h2 id="org76ec7eb">Caracteristicas</h2>
        <div class="outline-text-2" id="text-org76ec7eb">
          <ul class="org-ul">
            <li>Muestra un banner de Emacs (editable).</li>
            <li>Lista de archivos recientes.</li>
            <li>
              <a href="file:///2020-12-21-emacs-bookmarks.html">Bookmarks</a>
              list
            </li>
            <li>
              Proyectos recientes (para esto usa
              <a href="file:///2020-12-07-projectile.html">projectile</a> como
              dependencia)
            </li>
            <li>Agenda org-mode</li>
            <li>Lista de Registros</li>
          </ul>
        </div>
      </div>

      <div id="outline-container-org04f4cda" class="outline-2">
        <h2 id="org04f4cda">Dependencias</h2>
        <div class="outline-text-2" id="text-org04f4cda">
          <p>
            Para que todo funcióne correctamente son necesarios los siguientes
            paquetes (disponibles en Melpa):
          </p>

          <p>
            page-break-lines -
            <a href="https://github.com/purcell/page-break-lines"
              >https://github.com/purcell/page-break-lines</a
            >
            (optional) projectile -
            <a href="https://github.com/bbatsov/projectile"
              >https://github.com/bbatsov/projectile</a
            >
            (optional) all-the-icons -
            <a href="https://github.com/domtronn/all-the-icons.el"
              >https://github.com/domtronn/all-the-icons.el</a
            >
          </p>
        </div>
      </div>

      <div id="outline-container-org97fa788" class="outline-2">
        <h2 id="org97fa788">Instalación y uso</h2>
        <div class="outline-text-2" id="text-org97fa788">
          <pre class="example">
M-x package-install RET Dashboard
</pre
          >

          <pre class="example">
(require 'dashboard)
(dashboard-setup-startup-hook)
;; Or if you use use-package
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))
</pre
          >

          <p>
            En mi configuración personalizada todo esto y más se hace con
            use-package.
          </p>
        </div>
      </div>

      <div id="outline-container-orgadfc00c" class="outline-2">
        <h2 id="orgadfc00c">Mi configuración</h2>
        <div class="outline-text-2" id="text-orgadfc00c">
          <pre class="example">
;; Dashboard
(use-package dashboard
  :ensure t
  :custom
  (dashboard-banner-logo-title (format "Welcome to GNU/Emacs" user-full-name))
  (dashboard-startup-banner "~/storage/img/otra_estrella_min.png")
  (dashboard-items '((recents . 6)
		     (projects . 4)
		     (bookmarks . 4)
		     (agenda . 5)

		     ))
  :config

  (setq dashboard-set-heading-icons t
	dashboard-set-file-icons t
	dashboard-set-init-info t
	dashboard-set-navigator t)

  (setq dashboard-navigator-buttons
	`((
	   (,(when (display-graphic-p)
	       (all-the-icons-octicon "home" :height 1.1 :v-adjust 0.0))
	    "FAQ" "El universo perdido de GNU/Emacs"
	    (lambda (&amp;rest _) (browse-url "https://martiyo.github.io/faq")))

	   (,(when (display-graphic-p)
	       (all-the-icons-material "home" :height 1.35 :v-adjust -0.24))
	    "Localhost" "Abrir minnotas.com"
	    (lambda (&amp;rest _) (browse-url "http://misnotas.com/")))

	   (,(when (display-graphic-p)
	       (all-the-icons-octicon "tools" :height 1.0 :v-adjust 0.0))
	    "Configuración" "Archivo de configuración de emacs"
	    (lambda (&amp;rest _) (find-file (expand-file-name  "~/.emacs.d/init.el"))))

	   (,(when (display-graphic-p)
	       (all-the-icons-octicon "list-ordered" :height 1.0 :v-adjust 0.0))
	    "TODO" "Abrir myTodo"
	    (lambda (&amp;rest _) (find-file (expand-file-name  "~/org/myTodo.org"))))

	   (,(when (display-graphic-p)
	       (all-the-icons-octicon "calendar" :height 1.0 :v-adjust 0.0))
	    "Agenda" "Agenda personal"
	    (lambda (&amp;rest _)
	      (interactive)
	      (if (get-buffer "*Org Agenda*")
		  (progn
		    (switch-to-buffer-other-window "*Org Agenda*")
		    (kill-buffer "*Org Agenda*")
		    (org-agenda-list))
		(split-window-right)
		(org-agenda-list))))

	   )))
  :hook
  (after-init . dashboard-setup-startup-hook))
</pre
          >

          <p>
            <b>Fuentes</b>
          </p>

          <p>
            Esto es solo una guia que a la vez sirve como backup de la
            configuración que yo uso, la pagina de
            <a href="https://github.com/emacs-dashboard/emacs-dashboard"
              >github de dashboard</a
            >
            tiene la posta.
          </p>

          <p>
            Esta configuración y otras muy útilies está
            <a
              href="https://gitlab.com/hefistion/emacs-config-with-lp/-/blob/master/emacs-configuracion.org"
              >aquí</a
            >
          </p>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/faq/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/faq/tag-emacs.html">emacs</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/faq/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
